{
  "meta": {
    "title": "Marriage: God’s Pattern for Love",
    "slug": "marriage-gods-pattern-for-love",
    "date": "2026-02-17",
    "brand": "RCCG LSP HOME CONNECT",
    "subtitle": "Building marriage according to God’s pattern through companionship, mutual submission, initiating love, and faithful conduct.",
    "series_name": "",
    "category": "Family & Parenting",
    "tags": [
      "Marriage Covenant",
      "God’s Design For Marriage",
      "Mutual Submission",
      "Christlike Love",
      "Godly Conduct",
      "Building By God’s Pattern"
    ],
    "theme": "Violet",
    "font_pair": "cormorant-sourcesans",
    "available_themes": [
      {
        "id": "navy-gold",
        "label": "Navy & Gold (Presidential)"
      },
      {
        "id": "cream-black",
        "label": "Cream & Black (Stone Luxe)"
      },
      {
        "id": "green-gold",
        "label": "Green & Gold (Cathedral)"
      },
      {
        "id": "cozy-leather",
        "label": "Cozy Leather (Heritage)"
      },
      {
        "id": "cream-leather",
        "label": "Cream & Leather (Minimal Warmth)"
      },
      {
        "id": "lilac-purple",
        "label": "Lilac & Purple (Grace)"
      },
      {
        "id": "black-gold",
        "label": "Honeycomb Gold (Light)"
      },
      {
        "id": "Blueocean",
        "label": "Blueocean"
      },
      {
        "id": "BrownTan",
        "label": "Browntan"
      },
      {
        "id": "Turqbrown",
        "label": "Turqbrown"
      },
      {
        "id": "Violet",
        "label": "Violet"
      },
      {
        "id": "armygreen",
        "label": "Armygreen"
      },
      {
        "id": "greyish",
        "label": "Greyish"
      }
    ],
    "theme_vars": {
      "--outer-bg": "#07080b",
      "--ink": "#f7f4ec",
      "--muted": "rgba(247,244,236,.78)",
      "--accent": "#481860",
      "--accent-2": "#a860d8",
      "--hdr-ink": "#f7f4ec",
      "--hdr-shadow": "rgba(0,0,0,.55)",
      "--card-ink": "#f7f4ec",
      "--card-bg": "rgba(10,12,16,.44)",
      "--card-bg-2": "rgba(10,12,16,.30)",
      "--card-border": "rgba(72,24,96,0.420)",
      "--soft-border": "rgba(255,255,255,.14)"
    },
    "canonical_url": "",
    "brand_logo_path": "",
    "prayer_focus": [
      "Lord, align our marriage with Your design and restore companionship where distance has grown.",
      "Teach us mutual submission that honors Christ in our words, decisions, and tone.",
      "Form in us love that moves first—quick to forgive, serve, and pursue peace.",
      "Strengthen our daily conduct so our home reflects integrity, respect, and devotion to You."
    ],
    "next_step": "Choose one pattern commitment (companionship, mutual submission, initiating love, or godly conduct) and practice a specific action this week, then talk together about what changed.",
    "asset_prefix": "../../"
  },
  "at_a_glance": {
    "big_idea": "Marriage is not an accident; it is a design. Scripture shows God creating marriage for companionship, calling spouses to a posture of mutual submission, and pointing to love that moves first. When a home follows God’s pattern, it becomes a clear witness through daily conduct, not merely words.",
    "primary_passages": [
      "Genesis 2:18",
      "Ephesians 5:21",
      "Romans 5:8",
      "1 Peter 3:1-2",
      "Exodus 25:40"
    ],
    "key_takeaways": [
      "Marriage begins with God’s intention: it is “not good” for a person to be alone (Genesis 2:18).",
      "A biblical marriage is shaped by mutual submission, not self-centered control (Ephesians 5:21).",
      "Christlike love takes initiative—love moves toward the other first (Romans 5:8).",
      "Godly conduct in marriage can be a powerful witness beyond words (1 Peter 3:1-2).",
      "Building a marriage requires following God’s pattern, not improvising our own (Exodus 25:40)."
    ]
  },
  "introduction": "Marriage is presented in Scripture as God’s purposeful design, not a human invention. The Bible frames marriage as companionship, shaped by mutual submission, fueled by initiating love, and strengthened by consistent godly conduct. Like any structure meant to honor God, marriage flourishes when built according to His revealed pattern rather than personal preference.",
  "scripture_reading_and_context": [
    {
      "reference": "Genesis 2:18",
      "context": "God declares it is not good for a person to be alone and provides a corresponding helper, establishing marriage as companionship by God’s intention.",
      "from_transcript": true,
      "evidence": []
    },
    {
      "reference": "Ephesians 5:21",
      "context": "Marriage relationships are framed by a posture of mutual submission out of reverence for Christ, setting the relational tone before addressing specific behaviors.",
      "from_transcript": true,
      "evidence": []
    },
    {
      "reference": "Romans 5:8",
      "context": "God demonstrates love by acting first in Christ; this initiating, sacrificial love provides the model for how love operates.",
      "from_transcript": true,
      "evidence": []
    },
    {
      "reference": "1 Peter 3:1-2",
      "context": "Peter highlights how consistent, respectful conduct within marriage can influence others, showing the persuasive power of everyday godliness.",
      "from_transcript": true,
      "evidence": []
    },
    {
      "reference": "Exodus 25:40",
      "context": "God instructs that what is built for Him must follow the pattern He reveals, reinforcing the principle of building according to God’s design.",
      "from_transcript": true,
      "evidence": []
    }
  ],
  "key_points": [
    {
      "title": "God Designed Marriage for Companionship",
      "explanation": "Marriage begins with God’s purpose, not merely personal desire. Genesis shows God naming aloneness as “not good,” revealing that isolation is not His intended norm for human life. This frames marriage as a gift of companionship: a covenant relationship where two people share life, labor, and worship with a profound sense of belonging. Seeing marriage as God’s design helps reorient expectations. Instead of using marriage to solve every personal emptiness, spouses can receive companionship as part of God’s wise provision and pursue wholeness in relationship with God while loving one another faithfully.",
      "application": "",
      "application_items": [
        "Thank God specifically for the gift of companionship in marriage, naming ways it protects against isolation.",
        "Identify one area where independence has replaced partnership, and choose a shared practice (conversation, decision-making, service).",
        "Replace unrealistic expectations with a simple commitment: pursue faithful presence, not perfection.",
        "If distance has grown, schedule intentional time to rebuild friendship through listening and shared activities."
      ],
      "evidence": [],
      "scripture_refs": [
        "Genesis 2:18"
      ],
      "phase": "Key Point"
    },
    {
      "title": "Mutual Submission Sets the Tone",
      "explanation": "Ephesians describes a marriage atmosphere shaped by mutual submission. This is not a struggle for control, but a shared posture of humility—willingly placing the other’s good alongside one’s own. Mutual submission changes how spouses speak, decide, and respond. It replaces defensiveness with teachability and turns conflict into an opportunity to honor Christ through patience and respect. Practically, mutual submission looks like initiative in serving, readiness to listen, and a commitment to unity over winning. It is a pattern of love expressed through everyday choices, not a one-time promise.",
      "application": "",
      "application_items": [
        "Practice one specific act of mutual submission this week: yield a preference, share a responsibility, or prioritize the other’s need.",
        "In disagreements, ask: “What would honoring Christ look like in my tone and timing?”",
        "Choose a regular moment for calm conversation where each spouse speaks and listens without interruption.",
        "Confess and replace one controlling habit with a humble habit (asking, inviting input, showing gratitude)."
      ],
      "evidence": [],
      "scripture_refs": [
        "Ephesians 5:21"
      ],
      "phase": "Key Point"
    },
    {
      "title": "Love That Moves First",
      "explanation": "Romans shows the shape of God’s love: it initiates. God did not wait for people to become worthy; He moved toward them in Christ. That gospel pattern becomes the model for marital love. In marriage, “love that moves first” refuses to keep score. It takes the first step toward reconciliation, kindness, and service—even when feelings are strained. Initiating love is not denial of wrongs; it is courage to pursue peace and restoration. It seeks the other’s good and chooses sacrificial action over passive distance.",
      "application": "",
      "application_items": [
        "Do one unprompted act of kindness daily for a set period (help, encouragement, service) without expecting repayment.",
        "Initiate a repair conversation after tension: acknowledge your part clearly and ask how to move forward.",
        "Replace “I’ll change when they change” with one concrete step you can take immediately to show love.",
        "When tempted to withdraw, choose a small move toward connection: a gentle word, an apology, or an offer to help."
      ],
      "evidence": [],
      "scripture_refs": [
        "Romans 5:8"
      ],
      "phase": "Key Point"
    },
    {
      "title": "Conduct That Speaks",
      "explanation": "Scripture highlights the power of consistent conduct. 1 Peter emphasizes that respectful, pure behavior can carry persuasive weight beyond many words. In marriage, conduct includes tone, honesty, reliability, gentleness, and integrity in private life. Over time, these patterns build trust and create an environment where truth can be heard. This does not silence needed conversation; it prioritizes credibility. When daily conduct aligns with devotion to God, it becomes a steady witness that influences the home and honors Christ.",
      "application": "",
      "application_items": [
        "Choose one area where conduct needs strengthening (patience, honesty, respect) and practice a measurable change.",
        "Commit to speaking without contempt: remove insults, sarcasm meant to wound, and dismissive gestures.",
        "Let consistency lead: follow through on promises, responsibilities, and apologies.",
        "When conflict rises, pause before responding and choose a respectful tone that reflects reverence for God."
      ],
      "evidence": [],
      "scripture_refs": [
        "1 Peter 3:1-2"
      ],
      "phase": "Key Point"
    },
    {
      "title": "Follow God’s Pattern When Building",
      "explanation": "Exodus reinforces a principle: what is built to honor God must follow the pattern He reveals. God’s instructions were not optional suggestions; they were the design for something set apart for Him. Marriage also thrives when built according to God’s pattern rather than improvisation. When spouses decide that Scripture—not impulses, pride, or shifting opinions—will shape the home, the relationship gains stability and direction. Following God’s pattern means returning to foundational commitments: companionship by God’s intention, mutual submission, initiating love, and consistent godly conduct. Building takes time, but a clear pattern prevents aimless rebuilding after every storm.",
      "application": "",
      "application_items": [
        "Write down the core “pattern” commitments for your marriage (mutual submission, initiating love, respectful conduct) and review them regularly.",
        "Identify one habit that contradicts God’s pattern and replace it with a specific biblical practice (service, listening, confession).",
        "When making decisions, ask: “Does this align with God’s design for love and unity?”",
        "Seek accountability by inviting a trusted, mature couple or mentor to pray and check in on these commitments."
      ],
      "evidence": [],
      "scripture_refs": [
        "Exodus 25:40"
      ],
      "phase": "Key Point"
    }
  ],
  "group_discussion": {
    "OBSERVATION_QUESTIONS": [
      "In Genesis 2:18, what does God identify as “not good,” and what does that reveal about His intention for marriage?",
      "What exact posture does Ephesians 5:21 call for, and how is it described?",
      "According to Romans 5:8, what action demonstrates love, and what is significant about the timing of that action?",
      "In 1 Peter 3:1-2, what kinds of conduct are highlighted, and what impact can that conduct have?",
      "What does Exodus 25:40 emphasize about building according to a pattern, and why might that principle matter for marriage?"
    ],
    "INTERPRETATION_QUESTIONS": [
      "How does viewing marriage as God’s design change the way companionship is understood and pursued?",
      "What is the difference between mutual submission and self-centered control, based on Ephesians 5:21?",
      "Why is initiating love (Romans 5:8) essential for resolving conflict and sustaining long-term unity?",
      "How can conduct communicate more powerfully than words in a marriage, and what makes conduct credible?",
      "What might it look like, in practical terms, to “follow the pattern” of Scripture when building a marriage?"
    ],
    "APPLICATION_QUESTIONS": [
      "Where is companionship currently strong in your marriage, and where has isolation or distance begun to grow?",
      "What is one concrete act of mutual submission you can practice this week in decisions, responsibilities, or communication?",
      "What would “love that moves first” look like in your current situation—an apology, a conversation, an act of service, or a change in tone?",
      "Which aspect of conduct needs the most attention right now (respect, purity of motive, reliability, gentleness), and what is one measurable step to improve it?",
      "What is one area where you have been improvising rather than following God’s pattern, and how will you realign with Scripture?",
      "How can your home become a clearer witness through daily conduct rather than only through words?"
    ]
  },
  "conclusion": "Marriage reflects God’s wise design: companionship that addresses aloneness, a relational posture of mutual submission, love that initiates like Christ, and conduct that quietly testifies to God’s work. Building a lasting marriage requires returning to God’s pattern again and again. As these commitments shape everyday life, love becomes visible, trust strengthens, and the home grows into a steady witness through faithful conduct."
}